Infineon/AURIX_code_examples/code_examples/TC29xTP_BC-step/Project2/Libraries/Infra/Sfr/TC29B/_Reg/IfxQspi_reg.h
/** \brief  10, Global Configuration Register */
#define QSPI5_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0002110u)

/** \brief  14, Global Configuration Register 1 */
#define QSPI5_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0002114u)

/** \brief  8, Module Identification Register */
#define QSPI5_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0002108u)

/** \brief  F4, Kernel Reset Register 0 */
#define QSPI5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF00021F4u)

/** \brief  F0, Kernel Reset Register 1 */
#define QSPI5_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF00021F0u)

/** \brief  EC, Kernel Reset Status Clear Register */
#define QSPI5_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF00021ECu)

/** \brief  5C, MIX_ENTRY Register */
#define QSPI5_MIXENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_MIXENTRY*)0xF000215Cu)

/** \brief  E8, OCDS Control and Status */
#define QSPI5_OCS /*lint --e(923)*/ (*(volatile Ifx_QSPI_OCS*)0xF00021E8u)

/** \brief  4, Port Input Select Register */
#define QSPI5_PISEL /*lint --e(923)*/ (*(volatile Ifx_QSPI_PISEL*)0xF0002104u)

/** \brief  90, RX_EXIT Register */
#define QSPI5_RXEXIT /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXIT*)0xF0002190u)

/** \brief  94, RX_EXIT Debug Register */
#define QSPI5_RXEXITD /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXITD*)0xF0002194u)

/** \brief  48, Slave Select Output Control Register */
#define QSPI5_SSOC /*lint --e(923)*/ (*(volatile Ifx_QSPI_SSOC*)0xF0002148u)

/** \brief  40, Status Register */
#define QSPI5_STATUS /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS*)0xF0002140u)

/** \brief  44, Status Register 1 */
#define QSPI5_STATUS1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS1*)0xF0002144u)

/** \brief  58, Extra Large Data Configuration Register */
#define QSPI5_XXLCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_XXLCON*)0xF0002158u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXQSPI_REG_H */
